Repository: Dabolus/google-assistant-desktop-unofficial
Catalog: src/locales/*/messages.po
Languages: it_it

# bottomBar.placeholder
source: Type a message
it_it: Digita un messaggio

# settings.donate.description
source: Support this project
it_it: Sostieni questo progetto

# settings.donate.option
source: Donate
it_it: Dona

# settings.logout.description
source: Disconnect from Google Assistant
it_it: Disconnettiti dall'Assistente Google

# settings.metrics.description
source: Check out API calls latency and failures
it_it: Controlla la latenza e gli errori delle chiamate API

# settings.metrics.option
source: Metrics
it_it: Metriche

# topBar.assistant
source: Google Assistant
it_it: Assistente Google

# topBar.settings
source: Settings
it_it: Impostazioni

# wizard.actions.authorize
source: Authorize
it_it: Autorizza

# wizard.actions.next
source: Next
it_it: Avanti

# wizard.step1.hi
source: Hi!
it_it: Ciao!

# wizard.step1.welcome
source: Welcome to your brand new Google Assistant.
it_it: Benvenuto nel tuo nuovo Assistente Google.

# wizard.step2.disclaimer.agreement.text
source: By using the software you are fully aware that this is **not** an official Google product and you are taking the full responsibility of the interactions you will have with the Google services. You are also aware that everything this software does is to provide an appealing UI built with Google assets for the Google Assistant APIs, so the authors are not responsible for any possible copyright infringement. By using the Google Assistant APIs, you are also agreeing to the [Google Assistant SDK Terms of Service][assistant-tos].
it_it: Utilizzando questo software sei pienamente consapevole del fatto che questo **non** è un prodotto ufficiale Google e ti assumi la piena responsabilità delle interazioni che avrai con i servizi Google. Sei anche consapevole del fatto che tutto ciò che questo software fa è fornire un'interfaccia piacevole alle API dell'Assistente Google utilizzando gli asset di Google. Gli autori non sono dunque responsabili di eventuali violazioni di copyright. Utilizzando le API dell'Assistente Google, acconsenti anche ai [Termini di Servizio dell'SDK dell'Assistente Google][assistant-tos].

# wizard.step2.disclaimer.agreement.title
source: Agreement
it_it: Accordo

# wizard.step2.disclaimer.assets.text
source: The Google logo (google-logo) and the Google Assistant logo (assistant-logo) are Google trademarks. The display, body and icon fonts (Product Sans, Google Sans Display, Roboto, Material Icons Extended), as well as most of the assets used by the software, are made by Google and are freely available on the web.
it_it: Il logo Google (google-logo) e il logo dell'Assistente Google (assistant-logo) sono marchi registrati di Google. I font per i titoli, per i contenuti testuali e per le icone (Product Sans, Google Sans Display, Roboto, Material Icons Extended), così come la maggior parte degli asset utilizzati dal software sono stati creati da Google e sono disponibili gratuitamente sul web.

# wizard.step2.disclaimer.assets.title
source: The assets
it_it: Gli asset

# wizard.step2.disclaimer.introduction.text
source: This text will give you some information on the Google Assistant Desktop (hereinafter referred to as "the software"), the developers that are behind it (hereinafter referred to as "the authors"), the technologies and the responsibilities involved into its usage and how they can and will affect you. Please, be sure to read this text carefully, as pressing the _Next_ button will be considered as a confirmation that you have read and acknowledged it in its entirety.
it_it: Questo testo ti darà alcune informazioni su Google Assistant Desktop (in seguito denominato "il software"), gli sviluppatori che vi lavorano (in seguito denominati "gli autori"), le tecnologie e le responsabilità coinvolte nel suo utilizzo e come esse possono riguardarti e ti riguarderanno. Per favore, assicurati di leggere questo testo attentamente, in quanto premere il pulsante _Avanti_ sarà considerata una conferma di lettura e approvazione dello stesso nella sua interezza.

# wizard.step2.disclaimer.introduction.title
source: Introduction
it_it: Introduzione

# wizard.step2.disclaimer.software.text
source: Although the software closely resembles the look and feel of the original Google Assistant, it is **not** an official Google product. The software uses Google Assistant APIs to allow users to interact with the Assistant from devices that otherwise won't be able to use it. This means that, unlike the official Google products, the software might incur some limitations applied by Google itself. The authors do their best to provide the most straightforward and easiest possible interaction with the Google Assistant APIs to the end-users, but as humans, they can make errors. Expect to find some bugs in the product, especially in its initial phase of development. Also, to give full transparency to the end-users, the authors decided to make the software open source. This means that the end-users are free to browse the source code of the software and to eventually compile the source code and contribute to the development of the software itself. The source code of the software is available [at this link][source-code].
it_it: Sebbene il software simuli l'aspetto dell'Assistente Google, esso **non** è un prodotto ufficiale Google. Il software utilizza le API dell'Assistente Google per permettere agli utenti di interagire con l'Assistente da dispositivi che altrimenti non avrebbero la possibilità di utilizzarlo. Ciò vuol dire che, a differenza dei prodotti ufficiali Google, il software potrebbe incorrere in alcuni limiti applicati da Google stessa. Gli autori fanno del loro meglio per offrire l'esperienza più chiara e semplice possibile con le API dell'Assistente Google agli utenti finali, ma come esseri umani, possono commettere degli errori. Aspettati di trovare alcuni bug nel prodotto, in particolare nella fase di sviluppo iniziale. Inoltre, per offrire piena trasparenza agli utenti finali, gli autori hanno deciso di rendere il software open source. Ciò vuol dire che gli utenti finali hanno la libertà di navigare nel codice sorgente del software e di compilarlo, oltre che di contribuire allo sviluppo del software stesso. Il codice sorgente del software è disponibile [a questo link][source-code].

# wizard.step2.disclaimer.software.title
source: The software
it_it: Il software

# wizard.step2.title
source: First of all, read the disclaimer carefully.
it_it: Prima di tutto, leggi attentamente il disclaimer.

# wizard.step3.text
source: I did my best to detect your language, but I'm not completely sure it's the right one. Do you wish to change it?
it_it: Ho fatto del mio meglio per riconoscere la tua lingua, però non sono del tutto sicuro che sia quella giusta. Vorresti cambiarla?

# wizard.step3.title
source: Are you ok with this language?
it_it: Ti va bene questa lingua?

# wizard.step4.text.part1
source: A Google Cloud Platform project gives your device access to the Google Assistant API. The project tracks quota usage and gives you valuable metrics for the requests made from your device.
it_it: Un progetto di Google Cloud Platform permette al tuo dispositivo di accedere alle API dell'Assistente Google. Il progetto tiene traccia dell'utilizzo delle quote e ti fornisce delle utili metriche per le richieste fatte dal tuo dispositivo.

# wizard.step4.text.part2
source: In the Cloud Platform Console, [go to the Projects page][projects-page]. Select an existing project or create a new project.
it_it: Nella Console di Cloud Platform, [vai alla pagina dei Progetti][projects-page]. Seleziona un progetto esistente oppure crea un nuovo progetto.

# wizard.step4.text.part3
source: After creating the project, you need to enable the Assistant API. Click [here][assistant-api] to navigate to the Google API Console and then click _Enable_. Then, do the same with [the People API][people-api].
it_it: Dopo aver creato il progetto, devi abilitare le API dell'Assistente Google. Premi [qui][assistant-api] per navigare nella Console API Google e poi premi _Abilita_. Poi, fai la stessa cosa con [l'API per le Persone][people-api].

# wizard.step4.text.part4
source: When you're done, come back here and press _Next_, I'll be waiting for you.
it_it: Quando hai finito, torna qui e premi _Avanti_, sarò qui ad aspettarti.

# wizard.step4.title
source: Perfect! Now let's setup a project.
it_it: Perfetto! Ora creiamo un progetto.

# wizard.step5.text.part1
source: To correctly use the required APIs, the OAuth screen needs to be set up properly. Open [this link][oauth-consent], set **Application name** to whatever you want and add the `https://www.googleapis.com/auth/assistant-sdk-prototype` scope to the **Scopes for Google APIs** section. After adding it, your list should contain the following scopes:
it_it: Per utilizzare correttamente le API richieste, le schermata di accesso OAuth deve essere impostata correttamente. Apri [questo link][oauth-consent], imposta come **Nome applicazione** quello che preferisci e aggiungi lo scope `https://www.googleapis.com/auth/assistant-sdk-prototype` nella sezione **Scope per le API Google**. Dopo averlo aggiunto, gli scope abilitati dovrebbero essere i seguenti:

# wizard.step5.text.part2
source: When you're done, remember to click the _Save_ button!
it_it: Quando hai finito, ricordati di premere il pulsante _Salva_!

# wizard.step5.title
source: Almost there! Now you need to setup permissions correctly.
it_it: Quasi finito! Ora devi impostare correttamente i permessi.

# wizard.step6.idPlaceholder
source: Client ID
it_it: ID client

# wizard.step6.text.part1
source: To be able to get access to the project you just created, I will need an OAuth Client ID. Click [here][oauth-console] to go to the OAuth credentials creation wizard, give the product name you want if required, set _Other_ as application type, give to the client ID the name you prefer and then click _Create_.
it_it: Per poter accedere al progetto che hai appena creato, avrò bisogno di un Client ID OAuth. Premi [qui][oauth-console] to go to the OAuth credentials creation wizard, give the product name you want if required, set _Other_ as application type, give to the client ID the name you prefer and then click _Create_.

# wizard.step6.text.part2
source: You should now see a dialog with a Client ID and Secret; just copy/paste them down here:
it_it: Ora dovresti vedere una finestra di dialogo con ID client e Client secret; devi soltanto copiarli e incollarli qui sotto:

# wizard.step6.title
source: One last thing! Now you just need to authorize me.
it_it: Un'ultima cosa! Ora non ti resta che autorizzarmi.
